In [5]:
import pandas as pd 
Data=pd.read_csv("AddidasSales.csv")

In [6]:
Data.head()

,Retailer,Retailer_ID,Invoice_Date,Region,State,City,Product,Price_per_Unit,Units_Sold,Total_Sales,Operating_Profit,Operating_Margin,Sales_Method
0,Foot Locker,1185732.0,1/1/2020,Northeast,New York,New York,Men's Street Footwear,50.0,1200.0,600000.0,300000.0,0.50,In-store
1,Foot Locker,1185732.0,2/1/2020,Northeast,New York,New York,Men's Athletic Footwear,50.0,1000.0,500000.0,150000.0,0.30,In-store
2,Foot Locker,1185732.0,3/1/2020,Northeast,New York,New York,Women's Street Footwear,40.0,1000.0,400000.0,140000.0,0.35,In-store
3,Foot Locker,1185732.0,4/1/2020,Northeast,New York,New York,Women's Athletic Footwear,45.0,850.0,382500.0,133875.0,0.35,In-store
4,Foot Locker,1185732.0,5/1/2020,Northeast,New York,New York,Men's Apparel,60.0,900.0,540000.0,162000.0,0.30,In-store

In [10]:
Data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9651 entries, 0 to 9650
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Retailer          9650 non-null   object
 1   Retailer_ID       9649 non-null   float64
 2   Invoice_Date      9648 non-null   object
 3   Region            9648 non-null   object
 4   State             9649 non-null   object
 5   City              9649 non-null   object
 6   Product           9649 non-null   object
 7   Price_per_Unit    9649 non-null   float64
 8   Units_Sold        9650 non-null   float64
 9   Total_Sales       9649 non-null   float64
 10  Operating_Profit  9649 non-null   float64
 11  Operating_Margin  9649 non-null   float64
 12  Sales_Method      9648 non-null   object
dtypes: float64(6), object(7)
memory usage: 980.3+ KB

In [12]:
Data.describe()

,Retailer_ID,Price_per_Unit,Units_Sold,Total_Sales,Operating_Profit,Operating_Margin
count,9.649000e+03,9649.000000,9.650000e+03,9.649000e+03,9649.000000,9649.000000
mean,1.173728e+06,90.413307,8.158323e+02,1.865275e+05,34421.714469,0.422991
std,2.894136e+04,4440.183105,3.894795e+04,9.161387e+06,54191.448718,0.097192
min,0.000000e+00,0.000000,0.000000e+00,0.000000e+00,0.000000,0.100000
25%,1.185732e+06,35.000000,1.060000e+02,4.256000e+03,1922.000000,0.350000
50%,1.185732e+06,45.000000,1.760000e+02,9.576000e+03,4371.000000,0.410000
75%,1.185732e+06,55.000000,3.500000e+02,1.500000e+05,52063.000000,0.490000
max,1.197831e+06,436199.000000,2.915060e+06,8.999021e+08,390000.000000,0.800000

In [16]:
Data.shape

(9651, 13)

In [18]:
Data.Retailer_ID.unique()

array([1185732., 1197831., 1128299., 1189833.,       0.,      nan])

In [20]:
Data.Retailer_ID

0       1185732.0
1       1185732.0
2       1185732.0
3       1185732.0
4       1185732.0
          ...
9646    1185732.0
9647    1185732.0
9648          0.0
9649          NaN
9650          NaN
Name: Retailer_ID, Length: 9651, dtype: float64

In [24]:
Data.Region.unique()

array(['Northeast', 'South', 'West', 'Midwest', 'Southeast', nan],
      dtype=object)

In [26]:
Data.Region.value_counts()

Region
West         2448
Northeast    2376
Midwest      1872
South        1728
Southeast    1224
Name: count, dtype: int64

In [28]:
Data.sample()

,Retailer,Retailer_ID,Invoice_Date,Region,State,City,Product,Price_per_Unit,Units_Sold,Total_Sales,Operating_Profit,Operating_Margin,Sales_Method
6885,Sports Direct,1185732.0,9/10/2021,Midwest,North Dakota,Fargo,Men's Street Footwear,49.0,116.0,5684.0,2671.0,0.47,Online

In [30]:
Data.Total_Sales.value_counts()

Total_Sales
100000.0       67
90000.0        57
180000.0       57
135000.0       56
150000.0       53
               ..
6878.0          1
6237.0          1
11792.0         1
15525.0         1
899902125.0     1
Name: count, Length: 3139, dtype: int64

In [34]:
Data.Invoice_Date=pd.to_datetime(Data.Invoice_Date,dayfirst=True)

In [36]:
Data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9651 entries, 0 to 9650
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Retailer          9650 non-null   object
 1   Retailer_ID       9649 non-null   float64
 2   Invoice_Date      9648 non-null   datetime64[ns]
 3   Region            9648 non-null   object
 4   State             9649 non-null   object
 5   City              9649 non-null   object
 6   Product           9649 non-null   object
 7   Price_per_Unit    9649 non-null   float64
 8   Units_Sold        9650 non-null   float64
 9   Total_Sales       9649 non-null   float64
 10  Operating_Profit  9649 non-null   float64
 11  Operating_Margin  9649 non-null   float64
 12  Sales_Method      9648 non-null   object
dtypes: datetime64[ns](1), float64(6), object(6)
memory usage: 980.3+ KB

In [38]:
Data["Month"]=Data.Invoice_Date.dt.month

In [40]:
Data.sample()

,Retailer,Retailer_ID,Invoice_Date,Region,State,City,Product,Price_per_Unit,Units_Sold,Total_Sales,Operating_Profit,Operating_Margin,Sales_Method,Month
1117,Sports Direct,1197831.0,2021-09-11,South,Alabama,Birmingham,Women's Apparel,60.0,800.0,480000.0,312000.0,0.65,Outlet,9.0

In [42]:
Data["MonthName"]=Data.Invoice_Date.dt.month_name()

In [44]:
Data.sample()

,Retailer,Retailer_ID,Invoice_Date,Region,State,City,Product,Price_per_Unit,Units_Sold,Total_Sales,Operating_Profit,Operating_Margin,Sales_Method,Month,MonthName
2439,Amazon,1185732.0,2021-01-13,Southeast,North Carolina,Charlotte,Men's Street Footwear,35.0,775.0,271250.0,108500.0,0.4,Online,1.0,January

In [46]:
Data["Year"]=Data.Invoice_Date.dt.year

In [48]:
Data.sample()

,Retailer,Retailer_ID,Invoice_Date,Region,State,City,Product,Price_per_Unit,Units_Sold,Total_Sales,Operating_Profit,Operating_Margin,Sales_Method,Month,MonthName,Year
4136,Kohl's,1189833.0,2021-04-25,West,California,Los Angeles,Men's Street Footwear,41.0,238.0,9758.0,4977.0,0.51,Online,4.0,April,2021.0

In [52]:
Data.isnull().sum()

Retailer            1
Retailer_ID         2
Invoice_Date        3
Region              3
State               2
City                2
Product             2
Price_per_Unit      2
Units_Sold          1
Total_Sales         2
Operating_Profit    2
Operating_Margin    2
Sales_Method        3
Month               3
MonthName           3
Year                3
dtype: int64

In [62]:
Data.Region=Data.Region.fillna(value=Data.Region.mode()[0])

In [64]:
Data.isnull().sum()

Retailer            1
Retailer_ID         2
Invoice_Date        3
Region              0
State               2
City                2
Product             2
Price_per_Unit      2
Units_Sold          1
Total_Sales         2
Operating_Profit    2
Operating_Margin    2
Sales_Method        3
Month               3
MonthName           3
Year                3
dtype: int64

In [66]:
Data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9651 entries, 0 to 9650
Data columns (total 16 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Retailer          9650 non-null   object
 1   Retailer_ID       9649 non-null   float64
 2   Invoice_Date      9648 non-null   datetime64[ns]
 3   Region            9651 non-null   object
 4   State             9649 non-null   object
 5   City              9649 non-null   object
 6   Product           9649 non-null   object
 7   Price_per_Unit    9649 non-null   float64
 8   Units_Sold        9650 non-null   float64
 9   Total_Sales       9649 non-null   float64
 10  Operating_Profit  9649 non-null   float64
 11  Operating_Margin  9649 non-null   float64
 12  Sales_Method      9648 non-null   object
 13  Month             9648 non-null   float64
 14  MonthName         9648 non-null   object
 15  Year              9648 non-null   float64
dtypes: datetime64[ns](1), float64(8), object(7)
memory usage: 1.2+ MB

In [68]:
Data["Price_per_Unit"]=Data["Price_per_Unit"].fillna(value=Data["Price_per_Unit"].median())

In [70]:
Data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9651 entries, 0 to 9650
Data columns (total 16 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Retailer          9650 non-null   object
 1   Retailer_ID       9649 non-null   float64
 2   Invoice_Date      9648 non-null   datetime64[ns]
 3   Region            9651 non-null   object
 4   State             9649 non-null   object
 5   City              9649 non-null   object
 6   Product           9649 non-null   object
 7   Price_per_Unit    9651 non-null   float64
 8   Units_Sold        9650 non-null   float64
 9   Total_Sales       9649 non-null   float64
 10  Operating_Profit  9649 non-null   float64
 11  Operating_Margin  9649 non-null   float64
 12  Sales_Method      9648 non-null   object
 13  Month             9648 non-null   float64
 14  MonthName         9648 non-null   object
 15  Year              9648 non-null   float64
dtypes: datetime64[ns](1), float64(8), object(7)
memory usage: 1.2+ MB

In [76]:
Data.Retailer=Data.Retailer.fillna(Data.Retailer.mode()[0])

In [78]:
Data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9651 entries, 0 to 9650
Data columns (total 16 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Retailer          9651 non-null   object
 1   Retailer_ID       9649 non-null   float64
 2   Invoice_Date      9648 non-null   datetime64[ns]
 3   Region            9651 non-null   object
 4   State             9649 non-null   object
 5   City              9649 non-null   object
 6   Product           9649 non-null   object
 7   Price_per_Unit    9651 non-null   float64
 8   Units_Sold        9650 non-null   float64
 9   Total_Sales       9649 non-null   float64
 10  Operating_Profit  9649 non-null   float64
 11  Operating_Margin  9649 non-null   float64
 12  Sales_Method      9648 non-null   object
 13  Month             9648 non-null   float64
 14  MonthName         9648 non-null   object
 15  Year              9648 non-null   float64
dtypes: datetime64[ns](1), float64(8), object(7)
memory usage: 1.2+ MB

In [88]:
Data.Retailer_ID=Data.Retailer_ID.astype("object")

In [84]:
Data.Retailer_ID=Data.Retailer_ID.fillna(value=Data.Retailer_ID.mode()[0])

In [90]:
Data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9651 entries, 0 to 9650
Data columns (total 16 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Retailer          9651 non-null   object
 1   Retailer_ID       9651 non-null   object
 2   Invoice_Date      9648 non-null   datetime64[ns]
 3   Region            9651 non-null   object
 4   State             9649 non-null   object
 5   City              9649 non-null   object
 6   Product           9649 non-null   object
 7   Price_per_Unit    9651 non-null   float64
 8   Units_Sold        9650 non-null   float64
 9   Total_Sales       9649 non-null   float64
 10  Operating_Profit  9649 non-null   float64
 11  Operating_Margin  9649 non-null   float64
 12  Sales_Method      9648 non-null   object
 13  Month             9648 non-null   float64
 14  MonthName         9648 non-null   object
 15  Year              9648 non-null   float64
dtypes: datetime64[ns](1), float64(7), object(8)
memory usage: 1.2+ MB

In [94]:
Data['Invoice_Date'] = Data['Invoice_Date'].ffill()   # forward fill

In [96]:
Data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9651 entries, 0 to 9650
Data columns (total 16 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Retailer          9651 non-null   object
 1   Retailer_ID       9651 non-null   object
 2   Invoice_Date      9651 non-null   datetime64[ns]
 3   Region            9651 non-null   object
 4   State             9649 non-null   object
 5   City              9649 non-null   object
 6   Product           9649 non-null   object
 7   Price_per_Unit    9651 non-null   float64
 8   Units_Sold        9650 non-null   float64
 9   Total_Sales       9649 non-null   float64
 10  Operating_Profit  9649 non-null   float64
 11  Operating_Margin  9649 non-null   float64
 12  Sales_Method      9648 non-null   object
 13  Month             9648 non-null   float64
 14  MonthName         9648 non-null   object
 15  Year              9648 non-null   float64
dtypes: datetime64[ns](1), float64(7), object(8)
memory usage: 1.2+ MB

In [98]:
Data.State=Data.State.fillna(value=Data.State.mode()[0])

In [100]:
Data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9651 entries, 0 to 9650
Data columns (total 16 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Retailer          9651 non-null   object
 1   Retailer_ID       9651 non-null   object
 2   Invoice_Date      9651 non-null   datetime64[ns]
 3   Region            9651 non-null   object
 4   State             9651 non-null   object
 5   City              9649 non-null   object
 6   Product           9649 non-null   object
 7   Price_per_Unit    9651 non-null   float64
 8   Units_Sold        9650 non-null   float64
 9   Total_Sales       9649 non-null   float64
 10  Operating_Profit  9649 non-null   float64
 11  Operating_Margin  9649 non-null   float64
 12  Sales_Method      9648 non-null   object
 13  Month             9648 non-null   float64
 14  MonthName         9648 non-null   object
 15  Year              9648 non-null   float64
dtypes: datetime64[ns](1), float64(7), object(8)
memory usage: 1.2+ MB

In [102]:
Data.City=Data.City.fillna(value=Data.City.mode()[0])

In [104]:
Data.Product=Data.Product.fillna(value=Data.Product.mode()[0])

In [106]:
Data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9651 entries, 0 to 9650
Data columns (total 16 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Retailer          9651 non-null   object
 1   Retailer_ID       9651 non-null   object
 2   Invoice_Date      9651 non-null   datetime64[ns]
 3   Region            9651 non-null   object
 4   State             9651 non-null   object
 5   City              9651 non-null   object
 6   Product           9651 non-null   object
 7   Price_per_Unit    9651 non-null   float64
 8   Units_Sold        9650 non-null   float64
 9   Total_Sales       9649 non-null   float64
 10  Operating_Profit  9649 non-null   float64
 11  Operating_Margin  9649 non-null   float64
 12  Sales_Method      9648 non-null   object
 13  Month             9648 non-null   float64
 14  MonthName         9648 non-null   object
 15  Year              9648 non-null   float64
dtypes: datetime64[ns](1), float64(7), object(8)
memory usage: 1.2+ MB

In [108]:
Data.Units_Sold=Data.Units_Sold.fillna(value=Data.Units_Sold.median())

In [110]:
Data.Total_Sales=Data.Total_Sales.fillna(value=Data.Total_Sales.median())

In [112]:
Data.Operating_Profit=Data.Operating_Profit.fillna(value=Data.Operating_Profit.median())

In [114]:
Data.Operating_Margin=Data.Operating_Margin.fillna(value=Data.Operating_Margin.median())

In [116]:
Data.Sales_Method=Data.Sales_Method.fillna(value=Data.Sales_Method.mode()[0])

In [118]:
Data['Month'] = Data['Month'].ffill()   # forward fill

In [120]:
Data['MonthName'] = Data['MonthName'].ffill()   # forward fill

In [122]:
Data['Year'] = Data['Year'].ffill()   # forward fill

In [124]:
Data.sample()

,Retailer,Retailer_ID,Invoice_Date,Region,State,City,Product,Price_per_Unit,Units_Sold,Total_Sales,Operating_Profit,Operating_Margin,Sales_Method,Month,MonthName,Year
5932,West Gear,1197831.0,2021-07-06,West,Idaho,Boise,Men's Athletic Footwear,52.0,202.0,10504.0,5462.0,0.52,Online,7.0,July,2021.0

In [126]:
Data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9651 entries, 0 to 9650
Data columns (total 16 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Retailer          9651 non-null   object
 1   Retailer_ID       9651 non-null   object
 2   Invoice_Date      9651 non-null   datetime64[ns]
 3   Region            9651 non-null   object
 4   State             9651 non-null   object
 5   City              9651 non-null   object
 6   Product           9651 non-null   object
 7   Price_per_Unit    9651 non-null   float64
 8   Units_Sold        9651 non-null   float64
 9   Total_Sales       9651 non-null   float64
 10  Operating_Profit  9651 non-null   float64
 11  Operating_Margin  9651 non-null   float64
 12  Sales_Method      9651 non-null   object
 13  Month             9651 non-null   float64
 14  MonthName         9651 non-null   object
 15  Year              9651 non-null   float64
dtypes: datetime64[ns](1), float64(7), object(8)
memory usage: 1.2+ MB

In [140]:
Data.pivot_table(index="Region",values="Total_Sales",aggfunc="sum").sort_values(by="Total_Sales",ascending=False)

            Total_Sales
Region
West      1,169,864,459
Northeast   186,324,067
Southeast   163,171,236
South       144,663,181
Midwest     135,800,459

In [134]:
pd.options.display.float_format = '{:,.0f}'.format

In [156]:
Data.pivot_table(index="Product",values="Total_Sales",aggfunc="mean").sort_values(by="Total_Sales",ascending=False)

                           Total_Sales
Product
Men's Athletic Footwear        653,589
Men's Street Footwear          129,706
Women's Apparel                111,343
Women's Street Footwear         79,604
Men's Apparel                   77,041
Women's Athletic Footwear       66,396

In [148]:
Data.groupby(["Region","Product"])["Price_per_Unit"].mean()

Region     Product
Midwest    Men's Apparel                  47
           Men's Athletic Footwear        38
           Men's Street Footwear          42
           Women's Apparel                47
           Women's Athletic Footwear      35
           Women's Street Footwear        33
Northeast  Men's Apparel                  52
           Men's Athletic Footwear        45
           Men's Street Footwear          49
           Women's Apparel                52
           Women's Athletic Footwear      41
           Women's Street Footwear        40
South      Men's Apparel                  43
           Men's Athletic Footwear        37
           Men's Street Footwear          35
           Women's Apparel                44
           Women's Athletic Footwear      37
           Women's Street Footwear        35
Southeast  Men's Apparel                  55
           Men's Athletic Footwear        49
           Men's Street Footwear          49
           Women's Apparel                57
           Women's Athletic Footwear      46
           Women's Street Footwear        45
West       0                              45
           Men's Apparel                  53
           Men's Athletic Footwear     1,108
           Men's Street Footwear          46
           Women's Apparel                57
           Women's Athletic Footwear      47
           Women's Street Footwear        47
Name: Price_per_Unit, dtype: float64

In [154]:
Data.groupby("Product")["Total_Sales"].agg(["sum","mean","min","max"])

                                    sum    mean   min         max
Product
Men's Apparel               123,728,632  77,041   252     617,500
Men's Athletic Footwear   1,053,585,381 653,589   736 899,902,125
Men's Street Footwear       208,826,244 129,706 1,568     810,000
Women's Apparel             179,038,860 111,343   910     825,000
Women's Athletic Footwear   106,631,896  66,396     0     540,000
Women's Street Footwear     128,002,813  79,604   369     665,000

In [152]:
Data = Data[Data['Product'] != "0"]

In [158]:
Data.groupby("Sales_Method")["Total_Sales"].agg(["sum","mean","min","max"])

                       sum    mean   min         max
Sales_Method
In-store       356,643,750 204,968 7,500     825,000
Online       1,147,584,583 234,632     0 899,902,125
Outlet         295,585,493  97,908     0     780,000